# =============================================================================
# Brewfile — managed by `brew bundle`
# Install everything: brew bundle install
# Update this file from current machine: brew bundle dump --force
# =============================================================================

# -------------------------------------------------------
# Core CLI tools
# -------------------------------------------------------
brew "git"
brew "gh"           # GitHub CLI
brew "curl"
brew "wget"
brew "jq"           # JSON processor
brew "ripgrep"      # Fast grep (rg)
brew "fzf"          # Fuzzy finder
brew "tree"         # Directory tree view
brew "chezmoi"      # Dotfile manager

# -------------------------------------------------------
# Node / JS
# -------------------------------------------------------
brew "node"         # Node.js + npm
brew "fnm"          # Fast Node Manager (replaces nvm)

# -------------------------------------------------------
# Java (Eclipse Temurin / Adoptium)
# -------------------------------------------------------
cask "temurin@8"    # Java 8
cask "temurin@11"   # Java 11
cask "temurin@21"   # Java 21

# -------------------------------------------------------
# Apps (Casks)
# -------------------------------------------------------
cask "iterm2"
cask "docker"
cask "google-chrome"
cask "notion"
cask "nordvpn"
cask "raycast"

# IntelliJ — pick the edition you use, comment out the other
cask "intellij-idea"

# -------------------------------------------------------
# Fonts (useful for terminals / editors)
# -------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"  # Great for iTerm2

# -------------------------------------------------------
# Optional extras — uncomment what you want
# -------------------------------------------------------
# brew "httpie"       # Nicer curl for APIs
# brew "tldr"         # Simplified man pages
# brew "lazygit"      # Terminal git UI
# brew "k9s"          # Kubernetes TUI (if you ever need it)
# cask "postman"
# cask "slack"